Materials/NMTFD2/Ex01/OpenFoam/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0) //0
    (1 0 0)
    (1 0.1 0)
    (0 0.1 0)
    (-1 0.1 0)
    (-1 0 0)
    (0 -0.1 0)
    (1 -0.1 0)
    (0 0 0.001)
    (1 0 0.001)
    (1 0.1 0.001)
    (0 0.1 0.001)
    (-1 0.1 0.001)
    (-1 0 0.001)
    (0 -0.1 0.001)
    (1 -0.1 0.001)
);

blocks
(
    hex (5 0 3 4 13 8 11 12) (700 70 1) simpleGrading (1 1 1)
    hex (0 1 2 3 8 9 10 11) (700 70 1) simpleGrading (1 1 1)
    hex (6 7 1 0 14 15 9 8) (700 70 1) simpleGrading (1 1 1)
    
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (5 13 12 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 10 9)
            (7 1 9 15)
            
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (4 12 11 3)
            (3 11 10 2)
            
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (5 0 8 13)
            (6 7 15 14)
			(0 6 14 8)
            
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (5 4 3 0)
            (0 3 2 1) 
            (6 0 1 7)
            (13 8 11 12)
            (8 9 10 11)
            (14 15 9 8)
           
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
