Materials/NMTFD2/Ex01/OpenFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          70;
        startFace       292460;
    }
    outlet
    {
        type            patch;
        nFaces          140;
        startFace       292530;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1400;
        startFace       292670;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1470;
        startFace       294070;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          294000;
        startFace       295540;
    }
)

// ************************************************************************* //
